import json

table = [
    {"评级": "SSS+", "达成率下限": "100.5000%", "评级系数": 22.4},
    {"评级": "SSS", "达成率下限": "100.0000%", "评级系数": 21.6},
    {"评级": "SS+", "达成率下限": "99.5000%", "评级系数": 21.1},
    {"评级": "SS", "达成率下限": "99.0000%", "评级系数": 20.8},
    {"评级": "S+", "达成率下限": "98.0000%", "评级系数": 20.3},
    {"评级": "S", "达成率下限": "97.0000%", "评级系数": 20.0},
    {"评级": "AAA", "达成率下限": "94.0000%", "评级系数": 16.8},
    {"评级": "AA", "达成率下限": "90.0000%", "评级系数": 13.6},
    {"评级": "A", "达成率下限": "80.0000%", "评级系数": 12.8},
    {"评级": "BBB", "达成率下限": "75.0000%", "评级系数": 12.0},
    {"评级": "BB", "达成率下限": "70.0000%", "评级系数": 11.2},
    {"评级": "B", "达成率下限": "60.0000%", "评级系数": 9.6},
    {"评级": "C", "达成率下限": "50.0000%", "评级系数": 8.0},
    {"评级": "D", "达成率下限": "40.0000%", "评级系数": 6.4},
    {"评级": "30.0000%", "达成率下限": "4.8"},
    {"评级": "20.0000%", "达成率下限": "3.2"},
    {"评级": "10.0000%", "达成率下限": "1.6"},
    {"评级": "0.0000%", "达成率下限": "0.0"}
]

formatted_data = {}

for item in table:
    rating = item["评级"].replace("+", "p")
    limit = float(item["达成率下限"].replace("%", "")) / 100
    coefficient = item.get("评级系数")
    formatted_data[rating] = [limit, coefficient] if coefficient else [limit]

json_data = json.dumps(formatted_data, indent=4)

with open("ratings.json", "w") as file:
    file.write(json_data)